---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurves
source: html/2ad5f27d-ba53-492b-ef7a-dcda0203a923.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ManyDirectionCurves Property

More than one direction curve specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyDirectionCurves { get; }
```